GadgetOnOff_Project/src/Catalogs/Users/Users.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Users</name>
  <attributes>
    <name>FullName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>RightList</name>
    <attributes>
      <name>RuleName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>RuleView</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>On</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

GadgetOnOff_Project/src/Catalogs/Users/ObjectModule.bsl
Процедура ЗаполнитьТаблицуРолей() Экспорт
	
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	RightList.Очистить();
	НаборПрав = Метаданные.Роли;
	
	Для Каждого Роль Из НаборПрав Цикл
		
		СтрокаРоли = RightList.Добавить();
		СтрокаРоли.RuleName = Роль.Имя;
		СтрокаРоли.RuleView = Роль.Синоним;
		СтрокаРоли.On = Пользователь.Роли.Содержит(Роль);
		
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если Пользователь = Неопределено ТОгда
		
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
		Пользователь.ПолноеИмя = FullName;
		
	КонецЕсли;	
	СписокРолей = RightList.НайтиСтроки(Новый Структура("On",Истина));
	Для Каждого Роль Из СписокРолей Цикл
		
		Пользователь.Роли.Добавить(Метаданные.Роли.Найти(Роль.RuleName));
		
	КонецЦикла;	 
КонецПроцедуры
